app/controllers/links_controller.rb

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-12 22:24:23.417483"], ["title", "Twitter"], ["updated_at", "2015-02-12 22:24:23.417483"], ["url", "www.twitter.com"]]